app/views/static_pages/home.html.erb

    <a class="text-muted" href="<%= gossip_path(gossip.id) %>">
      <h5 class="pr-4 display-4 d-flex"> <%= gossip.user.first_name %> </h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    <div class="col-6 shape-bg ">
      <h2>Bienvenue <%= User.find_by(id: session[:user_id]).first_name %> !</h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]

  <a class="text-muted" href="<%= gossip_path(gossip.id) %>">
    <h5 class="pr-4 display-4 d-flex"> <%= gossip.user.first_name %> </h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]

  <div class="col-6 shape-bg d-flex justify-content-around">
    <h2>Bienvenue <%= User.find_by(id: session[:user_id]).first_name %> !</h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]