app/controllers/authors_controller.rb

  def create
    @user = User.create('first_name' => params[:first_name], 'last_name' => params[:last_name], city_id: 3, 'age' => params[:age], 'description' => params[:description], 'email' => params[:email], 'password' => params[:password])


      if @user.save
---
INSERT INTO "users" ("city_id", "first_name", "last_name", "description", "email", "age", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"