app/controllers/comments_controller.rb

  def create
    puts params
    @comment = Comment.new(content: params[:content], user_id: User.last.id, commenteable_type: "Gossip", commenteable_id: params[:gossip_id] )
      if @comment.save
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "comments" ("content", "user_id", "commenteable_type", "commenteable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @comment = Comment.find(params[:id])
    # puts params[:gossip]
    # comment_params = params.require(:comment).permit(:content)
    # comment_params = params[:content]
    puts "*" *70
    if @comment.update(content: params[:content], user_id: "11", commenteable_id: params[:gossip_id], commenteable_type: "Gossip")
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "user_id" = $2, "updated_at" = $3 WHERE "comments"."id" = $4  [["content", "Hi, I'm Jean eude. And you're about to stop being a pain in my ass."], ["user_id", 11], ["updated_at", "2019-02-07 19:18:13.758743"], ["id", 13]]