app/controllers/gossips_controller.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("user_id", "title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 54], ["title", "allezzz"], ["content", "je vous baise"], ["created_at", "2019-02-07 21:00:25.631387"], ["updated_at", "2019-02-07 21:00:25.631387"]]
---
   def create
    @gossip = Gossip.new('content' => params[:content],'title' => params[:title],'user_id' => User.last.id )
      if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "gossips" SET "content" = $1, "updated_at" = $2 WHERE "gossips"."id" = $3  [["content", "J'ai le cerveau qui ramolli ... de ouf"], ["updated_at", "2019-02-07 21:06:30.286119"], ["id", 15]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(gossip_params)