app/controllers/likes_controller.rb

INSERT INTO "likes" ("user_id", "likeable_type", "likeable_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 11], ["likeable_type", "Gossip"], ["likeable_id", 2], ["created_at", "2019-02-07 23:38:59.496934"], ["updated_at", "2019-02-07 23:38:59.496934"]]
---
  def create
    if already_liked?
      flash[:danger] = "You can't like more than once"
    else
      @gossip.likes.create(user_id: current_user.id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_gossip
    @gossip = Gossip.find(params[:gossip_id])

SELECT  1 AS one FROM "likes" WHERE "likes"."user_id" = $1 AND "likes"."likeable_id" = $2 LIMIT $3  [["user_id", 11], ["likeable_id", 2], ["LIMIT", 1]]
---
  def already_liked?
    Like.where(user_id: current_user.id, likeable:
      params[:gossip_id]).exists?