app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "soleil@gmail.com"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "fernand"], ["LIMIT", 1]]
---
  def create
    user = User.find_by('email' => params[:email] )
      if user && user.authenticate(params["password"])
        session[:user_id] = user.id
        redirect_to root_path
        puts "vous etes connecté #{user.first_name}"