app/views/cities/show.html.erb

      <% @cities.user.each do |user| %>
        <% user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = $1  [["user_id", 5]]