app/views/layouts/application.html.erb


  <h2>Bienvenue <%= User.find_by(id: session[:user_id]).first_name %> !</h2>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]